Revit 2024 API
FormulaManager.GetOperators Method
 Gets list of operator names supported by formula engine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static IList<string> GetOperators()
Visual Basic
Public Shared Function GetOperators As IList(Of String)
Visual C++
public:
static IList<String^>^ GetOperators()
See Also
FormulaManager Class
Autodesk.Revit.DB Namespace